#
# $Id: @(#)Messages_es.properties	1.2 01/03/28
#

#
# Diagnostic messages associated with DOM exceptions.
#
D-000 = INDEX_SIZE_ERR: Uno de los \u00EDndices est\u00E1 fuera de los l\u00EDmites.
D-001 = DOMSTRING_SIZE_ERR: El tama\u00F1o de la cadena est\u00E1 m\u00E1s all\u00E1 de los l\u00EDmites de la implementaci\u00F3n.
D-002 = HIERARCHY_REQUEST_ERR: Este nodo no est\u00E1 permitido aqu\u00ED.
D-003 = WRONG_DOCUMENT_ERR: Ese nodo no pertenece a este documento.
D-004 = INVALID_CHARACTER_ERR: Se ha especificado un car\u00E1cter no v\u00E1lido; por ejemplo, en un nombre.
D-005 = NO_DATA_ALLOWED_ERR: No se permiten datos en este nodo.
D-006 = NO_MODIFICATION_ALLOWED_ERR: El objeto es de s\u00F3lo lectura.
D-007 = NOT_FOUND_ERR: Ese nodo no existe en este contexto.
D-008 = NOT_SUPPORTED_ERR: Esta implementaci\u00F3n de DOM no admite ese tipo de nodo.
D-009 = INUSE_ATTRIBUTE_ERR: El atributo est\u00E1 vinculado a un elemento distinto.
D-010 = INVALID_STATE_ERR: El objeto no se puede utilizar, o se pod\u00EDa utilizar y ya no se puede.
D-011 = SYNTAX_ERR: Se ha especificado una cadena no v\u00E1lida o no permitida.
D-012 = INVALID_MODIFICATION_ERR: Se ha intentado modificar el tipo del objeto subyacente.
D-013 = NAMESPACE_ERR: Se ha intentado crear o cambiar un objeto de una forma incorrecta con respecto al espacio del nombre.
D-014 = INVALID_ACCESS_ERR: El objeto subyacente no admite el par\u00E1metro o la operaci\u00F3n
D-900 = ?? C\u00F3digo de mensaje DOM no reconocido ??

#
# Diagnostic messages associated with AttributeNode.
#
A-000 = El atributo ya est\u00E1 vinculado a un elemento: {0}.
A-001 = El elemento del atributo es desconocido.
A-002 = No puede suceder.

#
# Diagnostic messages associated with AttributeSet.
# 
A-003 = No es un atributo.
A-004 =	El atributo ya est\u00E1 vinculado a un elemento.

#
# Diagnostic messages associated with Doctype.
# 
DT-000 = NYI -- copia de dtd

#
# Diagnostic messages associated with ElementNode.
# 
EN-000 = Prefijo de espacio del nombre no declarado: {0}.
EN-001 = No se puede copiar.
EN-002 = El elemento no tiene etiqueta.
#
# Diagnostic messages associated with SimpleElementFactory.
# 
SEF-000 = Reasignaci\u00F3n incorrecta de ''{0}'' a la clase ''{1}'', no es subclase de org.apache.crimson.tree.ElementNode.
SEF-001 = Reasignaci\u00F3n incorrecta de la clave ''{0}'' a la clase '' {1}'', no encontrada: {2}.
SEF-002 = Reasignaci\u00F3n incorrecta de la clave ''{0}'' a la clase -- no es una cadena o una clase.
SEF-003 = No se puede lanzar un ejemplar del elemento para la etiqueta ''{0}'' desde la clase ''{1}'', {2}. 

#
# Diagnostic messages associated with TreeWalker.
# 
TW-000  = Tipo de nodo desconocido: {0}
TW-001 = actual == nulo.
TW-002 = antecesor == nulo.
TW-003 = El nodo no es una implementaci\u00F3n de org.apache.crimson.tree.
TW-004 = El nodo inicial no puede ser nulo.

#
# Diagnostic messages associated with XmlDocument.
# 
XD-000 = identificador nulo.
XD-001 = NYI -- profundo.
XD-002 = nombre de entidad nulo.
XD-003 = Entidad no declarada, no se puede escribir referencia: {0}. 

#
# Diagnostic messages associated with XmlDocumentBuilder.
# 
XDB-000 = pila de elementos no vac\u00EDa.
XDB-001 = Puede que el valor del atributo no contenga el s\u00EDmbolo de dos puntos: {0}. 
XDB-002 = El analizador ha devuelto atributos no permitidos: {0}.
XDB-003 = Los nombres de elementos pueden contener como m\u00E1ximo un s\u00EDmbolo de dos puntos: {0}. 
XDB-004 = Error de DOM: {0}.
XDB-005 = El prefijo de elemento no est\u00E1 declarado: {0}.
XDB-006 = El prefijo de atributo no est\u00E1 declarado: {0}.
XDB-007 = Los nombres de atributos pueden contener como m\u00E1ximo un s\u00EDmbolo de dos puntos: {0}.
XDB-008 = El atributo de \u00E1mbito aparece dos veces: {0}. 
XDB-009 = no se puede finalizar el elemento <{0}> porque el elemento actual es {1}.
XDB-010 = Los nombres de destino de la instrucci\u00F3n de proceso no deben estar calificados.
XDB-011 = no se puede finalizar la entidad <{0}> porque la entidad actual es {1}.
XDB-012 = Los nombres de entidad no deben estar calificados.
XDB-013 = Los nombres de notaci\u00F3n no deben estar calificados.


